Revit 2026 API

# GradientType Enumeration

---

The enumerated type representing the permitted values for the asset property "GradientType" from the "Gradient" schema.

**Namespace:** Autodesk.Revit.DB.Visual**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public enum GradientType
```
```vb
Public Enumeration GradientType
```
```cpp
public enum class GradientType
```
```fsharp
type GradientType
```

| Member name | Value | Description |
| --- | --- | --- |
| Box | 1 |  |
| Diagonal | 2 |  |
| Fourcorner | 0 |  |
| Lighting | 3 |  |
| Linear | 4 |  |
| Mapped | 5 |  |
| Normal | 6 |  |
| Pong | 7 |  |
| Radial | 8 |  |
| Spiral | 9 |  |
| Sweep | 10 |  |
| Tartan | 11 |  |

#### Reference

Autodesk.Revit.DB.Visual Namespace